In [1]:
import pandas as pd

In [3]:
people = {
    "First" : ['Val','Lopy','Vicky','Chiri'],
    "Last" : ['Chela','Sharon','Chepkoech','Beaty'],
    "Email" : ['chela@gmail.com','sharon@gmail.com','vicky@gmail.com','chiri@gmail.com']
}

In [5]:
df = pd.DataFrame(people)

In [7]:
df

   First       Last             Email
0    Val      Chela   chela@gmail.com
1   Lopy     Sharon  sharon@gmail.com
2  Vicky  Chepkoech   vicky@gmail.com
3  Chiri      Beaty   chiri@gmail.com

In [9]:
df['FullName'] = df['First'] + ' ' + df['Last']

In [11]:
df

   First       Last             Email         FullName
0    Val      Chela   chela@gmail.com        Val Chela
1   Lopy     Sharon  sharon@gmail.com      Lopy Sharon
2  Vicky  Chepkoech   vicky@gmail.com  Vicky Chepkoech
3  Chiri      Beaty   chiri@gmail.com      Chiri Beaty

In [15]:
df.drop(columns=['First','Last'],inplace=True)

In [17]:
df

              Email         FullName
0   chela@gmail.com        Val Chela
1  sharon@gmail.com      Lopy Sharon
2   vicky@gmail.com  Vicky Chepkoech
3   chiri@gmail.com      Chiri Beaty

In [19]:
df['FullName'].str.split(' ')

0          [Val, Chela]
1        [Lopy, Sharon]
2    [Vicky, Chepkoech]
3        [Chiri, Beaty]
Name: FullName, dtype: object

In [21]:
df['FullName'].str.split(' ',expand=True)

       0          1
0    Val      Chela
1   Lopy     Sharon
2  Vicky  Chepkoech
3  Chiri      Beaty

In [23]:
df[['First','Last']] = df['FullName'].str.split(' ',expand=True)

In [25]:
df

              Email         FullName  First       Last
0   chela@gmail.com        Val Chela    Val      Chela
1  sharon@gmail.com      Lopy Sharon   Lopy     Sharon
2   vicky@gmail.com  Vicky Chepkoech  Vicky  Chepkoech
3   chiri@gmail.com      Chiri Beaty  Chiri      Beaty

In [29]:
df._append({'Last':'Rono'},ignore_index=True)

              Email         FullName  First       Last
0   chela@gmail.com        Val Chela    Val      Chela
1  sharon@gmail.com      Lopy Sharon   Lopy     Sharon
2   vicky@gmail.com  Vicky Chepkoech  Vicky  Chepkoech
3   chiri@gmail.com      Chiri Beaty  Chiri      Beaty
4               NaN              NaN    NaN       Rono

In [31]:
people = {
    "First" : ['Eunice','Livingstone'],
    "Last" : ['Sambu','Rono'],
    "Email" : ['sambu@gmail.com','rono@gmail.com']
}
df2 = pd.DataFrame(people)

In [33]:
df2

         First   Last            Email
0       Eunice  Sambu  sambu@gmail.com
1  Livingstone   Rono   rono@gmail.com

In [45]:
df = df._append(df2,ignore_index=True)

In [47]:
df

              Email         FullName        First       Last
0   chela@gmail.com        Val Chela          Val      Chela
1  sharon@gmail.com      Lopy Sharon         Lopy     Sharon
2   vicky@gmail.com  Vicky Chepkoech        Vicky  Chepkoech
3   chiri@gmail.com      Chiri Beaty        Chiri      Beaty
4   sambu@gmail.com              NaN       Eunice      Sambu
5    rono@gmail.com              NaN  Livingstone       Rono

In [49]:
df.drop(index=5)

              Email         FullName   First       Last
0   chela@gmail.com        Val Chela     Val      Chela
1  sharon@gmail.com      Lopy Sharon    Lopy     Sharon
2   vicky@gmail.com  Vicky Chepkoech   Vicky  Chepkoech
3   chiri@gmail.com      Chiri Beaty   Chiri      Beaty
4   sambu@gmail.com              NaN  Eunice      Sambu